examples/Query_example-Finnish_PIC.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:fi:tulli:wsdl_root.002" xmlns:urn1="urn:iso:std:iso:20022:tech:xsd:head.001.001.01" xmlns:urn2="urn:iso:std:iso:20022:tech:xsd:auth.001.001.01" xmlns:urn3="urn:fin.012.001.03">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:ApplicationRequest id="applicationRequest">
            <urn1:AppHdr>
                <urn1:CharSet>UTF-8</urn1:CharSet>
                <urn1:Fr>
                    <urn1:OrgId>
                        <urn1:Id>
                            <urn1:OrgId>
                                <urn1:Othr>
                                    <urn1:Id>0245442-8</urn1:Id>
                                    <urn1:SchmeNm>
                                        <urn1:Cd>Y</urn1:Cd>
                                    </urn1:SchmeNm>
                                </urn1:Othr>
                            </urn1:OrgId>
                        </urn1:Id>
                    </urn1:OrgId>
                </urn1:Fr>
                <urn1:To>
                    <urn1:OrgId>
                        <urn1:Id>
                            <urn1:OrgId>
                                <urn1:Othr>
                                    <urn1:Id>0245442-8</urn1:Id>
                                    <urn1:SchmeNm>
                                        <urn1:Cd>Y</urn1:Cd>
                                    </urn1:SchmeNm>
                                </urn1:Othr>
                            </urn1:OrgId>
                        </urn1:Id>
                    </urn1:OrgId>
                </urn1:To>
                <urn1:BizMsgIdr>r6/bz9dlT567HVr5RDi8Zw==</urn1:BizMsgIdr>
                <urn1:MsgDefIdr>auth.001.001.01</urn1:MsgDefIdr>
                <urn1:CreDt>2021-07-28T07:31:11Z</urn1:CreDt>
                <urn1:Sgntr>
                    <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                        <SignedInfo>
                            <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                            <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
                            <Reference URI="#applicationRequest">
                                <Transforms>
                                    <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                                    <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                                </Transforms>
                                <DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
                                <DigestValue>ti7iAjX+UMwHPE7Ub1MDYdQ34vimdHVh2VCZV1K/+PI=</DigestValue>
                            </Reference>
                        </SignedInfo>
                        <SignatureValue>kzGx/HyO7vtjMqu03DpgsvfxEnF1vc1AlAoRgdG6BFP0OnaVqOSjglrmTNC7T3m2
sf1EBZir4laR8ICbhboRHEFw0VS/GqLMuAf5LShgvGBGZz2GRLGQzM52I+eb9ue7
QYZCoZLy1zcqM40YvO1A5MJr7ElVYo/N6hwXxpYOOcpWLZLiKPpTJyFmS/XUBtaa
hbCeS2FUb2GyXo7jxaCi/POqTDmy2yf7YN0nGL6D8cyyEKpOydZsVTmP2rk79t+e
M5sdNbCiIOJqgxwpe54py6BqRvV8NPxVGxCMSQogJb3FvKoRlZYXPk1SO7b1IQSQ
xF6ynl+k41K8l4GhAY7FUBqG7WJDdwOfa5PU2aflQrfX/Bk/GCeN/GEr2garGF2I
HxlX6dt7S6VgBgquyuW3lR/0uNl/i4sHq/gP22HWh/ZWQyooKe5uc6zYl92wCKsO
h1c5wGlLisOFWzshiWKJzL5nVtxBhP/bB9dyRvL0sbq1TtHjHlx4fLcIQDDPAOMZ
Gw+51IhqNfyXZ9he7DS1/kXjr1KcfVQDPneSqkKQ/ZFXdVlH6AIBjx/Dq8013B8a
R9Rt9bSKPDtEpQOgHM0Em9QYtzGyNWG7msA4pAXJ1Bt2WgdME/Z34agqDrSxNF8R
qevEo4NScuPulPwBG3Qfy8dbUD29nPJmHk3VRu0OFU0=</SignatureValue>
                        <KeyInfo>
                            <X509Data>
<X509Certificate>MIIH3zCCBcegAwIBAgIPAYAYeBKtkUisx5JrWEEaMA0GCSqGSIb3DQEBDQUAMIGH
MQswCQYDVQQGEwJGSTEpMCcGA1UECgwgRGlnaS0gamEgdmFlc3RvdGlldG92aXJh
c3RvIFRFU1QxHzAdBgNVBAsMFlRlc3RpcGFsdmVsdXZhcm1lbnRlZXQxLDAqBgNV
BAMMI0RWViBURVNUIFNlcnZpY2UgQ2VydGlmaWNhdGVzIC0gRzJSMB4XDTIyMDQx
MjIxMDAwMFoXDTIzMDQxMjIwNTk1OVowcTELMAkGA1UEBhMCRkkxEDAOBgNVBAgM
B0ZpbmxhbmQxETAPBgNVBAcMCEhlbHNpbmtpMQ4wDAYDVQQKDAVUdWxsaTESMBAG
A1UEBRMJMDI0NTQ0Mi04MRkwFwYDVQQDDBBhYy10ZXN0LnR1bGxpLmZpMIICIjAN
BgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAydbzpnpUkHWFIwc0RUYBGtJS7OPA
B3iSF8ZipBiRnBXpWk/0CR/I/jvr3vAgfNbDkK/+8tCFzkhtIFhZA82sKpYsfcly
Z3CvTbTFyEpQIOT2tvdM69VBuBfMxjLb871W5sxVjkd/PMyG7HlxxRWJbXmnoIle
Uugl3hu9qe7dVJ8lfEYJZlstxgxFTi9AHkkzFQhxqmMx083Fn1QIJsxa9ZMcXJUp
2ITq+KqxeiKd7sTA+yJdFj6qNk7+HUwgP4hfv7eY41Bof5aboVpZ+zGJ+HIcMOvO
1ghalnXvUHyxst56eU/BR9XunuabUXVrf48Uvmi0AveOL6kwKwL9P3Ol2ptc+UBe
eTv9ubL56R+0XT5FV0Lcs1ZOZhxpTFb+XVUDOf2aCwRVkx4BMuh7PjnNJhZKzNUF
JFNCbYcKVbHMr84NSNGs86C+kACiufON1XMVbqyJVOQTNLp6Jwx6q7yvJksaz4F/
QdTXpjk/yYiqMQGnvREpzV4YHcrVR1vmkEVt1Znmvvfydy6wNRk2RNYtGE9fb8/h
kFJY0nGJSvuXQaLyfktHEtaOFhS7/R/GtjVr2A/mOza7e44j4Sahjvrhhq775L5y
B5ropvwHyH+ja/1AxQhf1FrbzlXh/j7FEumEctfzUy+XAARENPrkGzydza6T91/C
W/IVLsjNE90gCPsCAwEAAaOCAlswggJXMB8GA1UdIwQYMBaAFDQF8tsG3TMgbOEI
B8dsT/BspB50MB0GA1UdDgQWBBTePq9whT0VkXayvYLyJV9Z7JjEazAOBgNVHQ8B
Af8EBAMCBLAwgdcGA1UdIASBzzCBzDAIBgYEAI96AQcwgb8GCiqBdoQFYwqCMQEw
gbAwJwYIKwYBBQUHAgEWG2h0dHA6Ly93d3cuZmluZWlkLmZpL2Nwczk5LzCBhAYI
KwYBBQUHAgIweBp2VmFybWVubmVwb2xpdGlpa2thIG9uIHNhYXRhdmlsbGEgLSBD
ZXJ0aWZpa2F0cG9saWN5IGZpbm5zIC0gQ2VydGlmaWNhdGUgcG9saWN5IGlzIGF2
YWlsYWJsZSBodHRwOi8vd3d3LmZpbmVpZC5maS9jcHM5OTAbBgNVHREEFDASghBh
Yy10ZXN0LnR1bGxpLmZpMA8GA1UdEwEB/wQFMAMBAQAwOQYDVR0fBDIwMDAuoCyg
KoYoaHR0cDovL3Byb3h5LmZpbmVpZC5maS9jcmwvZHZ2dHNwMnJjLmNybDAdBgNV
HSUEFjAUBggrBgEFBQcDAgYIKwYBBQUHAwEwdAYIKwYBBQUHAQEEaDBmMDMGCCsG
AQUFBzAChidodHRwOi8vcHJveHkuZmluZWlkLmZpL2NhL2R2dnRzcDJyYy5jcnQw
LwYIKwYBBQUHMAGGI2h0dHA6Ly9vY3NwdGVzdC5maW5laWQuZmkvZHZ2dHNwMnJj
MC0GCCsGAQUFBwEDBCEwHzAIBgYEAI5GAQEwEwYGBACORgEGMAkGBwQAjkYBBgMw
DQYJKoZIhvcNAQENBQADggIBAJiiB6e3sY0i82k/VlK5ynRixyk3reXh/LLBbEbL
Z+mRMDhvSQWO6bz7YPLHBhvFyqS5mEME2Q1C+oLBS2fxJxqwCRZKbwdfWn+RdTVF
F37Xpqmfhm4giIzg3TxeNQG/hjqKmeFZ0Xf/g+PPSc4sPMbM8lTV+myaqwvRNHRC
pC2miCf9W6eGzf8Fe2ePOEq1fe5mEikeaV1s+re+hBPh8xpNPzEBTBI8KelUq4m1
VQaQ4Y4KmDOwg2eh8Mp71x2kqdHZCWVMSNiIU1PXDhvd6YekbT7pCQbqwGiLdd2Z
A9s/72c6SUaOC/armcr+VouyvrtVndix7k4S+Y6aiBfYtLx9UVM0hfmLNYDGqCgj
PIKfaHSmmGRBtHZVZurI/fiIdQFj5/KrGqsXvJ/ZU4kcX593tuAO4OfLTlBosILW
RuunBXXemP42TRs7n5NOuhWvoEprRFV0F7JKduCtJErDY3K0MBEtxWubEASnAGoP
cdtbCBluTe5WqOPCLBpBvpSLLeiXn1WFCvGV6wVuTwgtlwfDz1A2rT40RbBf94go
1yG7sR1Rq1cWYgEL4odz3EB8bWT5VbDnrlC3qD5NShHdzLZsXVnCOzX9u6iFThim
FMyNBdb9oHI7sG6EIlAPq3zPj/jGmUG5ILeeN0PdAzYy/eeDww0mKGNebXKxUu0J
EDr0</X509Certificate>
</X509Data>
                        </KeyInfo>
                    </Signature>
                </urn1:Sgntr>
            </urn1:AppHdr>
            <urn2:Document>
                <urn2:InfReqOpng>
                    <urn2:InvstgtnId>ABC1234</urn2:InvstgtnId>
                    <urn2:LglMndtBsis>
                        <urn2:Prgrph>testi</urn2:Prgrph>
                    </urn2:LglMndtBsis>
                    <urn2:CnfdtltySts>true</urn2:CnfdtltySts>
                    <urn2:InvstgtnPrd>
                        <urn2:Dt>
                            <urn2:FrDt>1900-01-01</urn2:FrDt>
                            <urn2:ToDt>2021-07-28</urn2:ToDt>
                        </urn2:Dt>
                    </urn2:InvstgtnPrd>
                    <urn2:SchCrit>
                        <urn2:CstmrId>
                            <urn2:Pty>
                                <urn2:Id>
                                    <urn2:PrvtId>
                                        <urn2:Othr>
                                            <urn2:Id>201176-452Y</urn2:Id>
                                            <urn2:SchmeNm>
                                                <urn2:Cd>PIC</urn2:Cd>
                                            </urn2:SchmeNm>
                                        </urn2:Othr>
                                    </urn2:PrvtId>
                                </urn2:Id>
                            </urn2:Pty>
                            <urn2:AuthrtyReq>
                                <urn2:Tp>
                                    <urn2:MsgNmId>supl.027.001.01</urn2:MsgNmId>
                                </urn2:Tp>
                                <urn2:InvstgtdRoles>
                                    <urn2:Cd>ALLP</urn2:Cd>
                                </urn2:InvstgtdRoles>
                            </urn2:AuthrtyReq>
                            <urn2:AuthrtyReq>
                                <urn2:Tp>
                                    <urn2:MsgNmId>fin.002.001.03</urn2:MsgNmId>
                                </urn2:Tp>
                                <urn2:InvstgtdRoles>
                                    <urn2:Cd>ALLP</urn2:Cd>
                                </urn2:InvstgtdRoles>
                            </urn2:AuthrtyReq>
                            <urn2:AuthrtyReq>
                                <urn2:Tp>
                                    <urn2:MsgNmId>fin.013.001.04</urn2:MsgNmId>
                                </urn2:Tp>
                                <urn2:InvstgtdRoles>
                                    <urn2:Cd>ALLP</urn2:Cd>
                                </urn2:InvstgtdRoles>
                            </urn2:AuthrtyReq>
                        </urn2:CstmrId>
                    </urn2:SchCrit>
                    <urn2:SplmtryData>
                        <urn2:Envlp>
                            <urn3:Document>
                                <urn3:InfReqFin012>
                                    <urn3:AuthorityInquiry>
                                        <urn3:OfficialId>Viranomaisen nimi</urn3:OfficialId>
                                        <urn3:OfficialSuperiorId>Esimiehen nimi</urn3:OfficialSuperiorId>
                                    </urn3:AuthorityInquiry>
                                </urn3:InfReqFin012>
                            </urn3:Document>
                        </urn2:Envlp>
                    </urn2:SplmtryData>
                </urn2:InfReqOpng>
            </urn2:Document>
        </urn:ApplicationRequest>
    </soapenv:Body>
</soapenv:Envelope>